# Brewfile for common tools and software used on any computer

tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "peripheryapp/periphery"
tap "robotsandpencils/made"
tap "woshiccm/tap"

brew "aria2"
brew "carthage"
brew "cocoapods"
brew "coreutils"
brew "fastlane"
brew "ffmpeg"
brew "git"
brew "gh"
brew "htop"
brew "jpeg", link: true
brew "libpng"
brew "mas"
brew "openssl@1.1"
brew "openssl@3"
brew "pre-commit"
brew "pyenv"
brew "python@3.9"
brew "robotsandpencils/made/xcodes"
brew "sqlite3"
brew "swiftformat"
# brew "swiftlint" # requires Xcode 14.0 and will fail on older systems
brew "tree"
brew "yt-dlp"
brew "zsh"

cask "aerial"
cask "db-browser-for-sqlite"
cask "devutils"
cask "figma"
cask "keka"
cask "google-chrome"
#cask "imagemagick"
cask "iterm2"
cask "lulu"
cask "obs"
cask "postman"
cask "proxyman"
cask "pycharm"
cask "reveal"
cask "rocket"
cask "sf-symbols"
cask "slack"
cask "stats"
cask "thingsmacsandboxhelper"
cask "tower"
cask "transmission"
#cask "transmission-cli"
cask "visual-studio-code"
cask "virtualbox"
cask "vlc"
cask "xcodes"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Bakery", id: 1575220747
mas "DevCleaner for Xcode", id: 1388020431
#mas "Developer", id: 640199958
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Swift Playgrounds", id: 1496833156
# mas "Rocketsim", id: 1504940162
# mas "TestFlight", id: 899247664
mas "Things 3", id: 904280696
mas "Transporter", id: 1450874784
mas "Twitter", id: 1482454543
mas "Wipr", id: 1320666476
